#### MasonryCMUApplicationType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "MasonryCMUApplication" from the "MasonryCMU" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum MasonryCMUApplicationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MasonryCMUApplicationType ``` |

| Visual C++ |
| --- |
| ``` public enum class MasonryCMUApplicationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Glossy |  |
| Matte |  |
| Unfinished |  |

# See Also

Autodesk.Revit.DB.Visual Namespace